infra/artillery/scenario.yml
---
config:
  plugins:
    metrics-by-endpoint: {}
  defaults:
    headers:
      Origin: "https://perf.passculture.app"
      Content-Type: "application/json"
  phases:
    - duration: 20
      arrivalRate: 1
      name: "Sustained load"
  target: "https://pass-culture-api-perf.osc-fr1.scalingo.io"
  payload:
    - path: "user_list"  # Needs to contains valid users
      fields:
        - "id"
        - "lastName"
        - "firstName"
        - "email"
        - "phoneNumber"
        - "city"
        - "zipCode"
        - "birthDate"
        - "password"
      order: sequence
    - path: "word_list_fr"
      fields:
        - "word"
      order: sequence
scenarios:
  - flow:
      - post:
          json:
            identifier: "{{ email }}"
            password: "{{ password }}"
          capture:
            json: "id"
            as: "id"
          url: "/users/signin"
      - put:
          url: "/recommendations"
          ifTrue: "id"
          json:
            seenRecommendationIds: []
      - think: 20
      - put:
          url: "/recommendations"
          ifTrue: "id"
          json:
            seenRecommendationIds: []
      - think: 20
      - get:
          url: "/recommendations?keywords={{ word }}"
          ifTrue: "id"
      - get:
          url: "/recommendations?keywords={{ word }}&page=2"
          ifTrue: "id"
      - think: 7
      - get:
          url: "/recommendations?keywords={{ word }}&page=3"
          ifTrue: "id"
      - get:
          url: "/recommendations?keywords={{ word }}&page=4"
          ifTrue: "id"